app/controllers/articles_controller.rb

  def new
    @article = Article.new
    @category = Category.find(params[:category_id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", nil]]

  def show
    @article = Article.find(params[:id])
    @category = Category.find_by(id: @article.category_id)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]

  def create

    @category = Category.find(params[:category_id])
    @article = Article.new(articles_params)
    @article.category = @category
    @article.user = current_user

    if @article.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "articles" ("title", "body", "category_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "woof woof"], ["body", "lalala"], ["category_id", 1], ["user_id", 1], ["created_at", "2016-05-23 23:26:13.073931"], ["updated_at", "2016-05-23 23:26:13.073931"]]