app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "coding"], ["created_at", "2016-05-23 18:49:49.348881"], ["updated_at", "2016-05-23 18:49:49.348881"]]
---
  def create
    @category= Category.new(categories_params)
    if @category.save